{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[56, 24], [0, 0]], "input_dtype": "float32", "trainable": true, "name": "cropping2d_1"}}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 2], "trainable": true, "pool_size": [1, 2], "border_mode": "valid", "name": "averagepooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s\\\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0002\u0000|\u0000\u0000|\u0001\u0000\u0018|\u0002\u0000|\u0001\u0000\u0018\u001bd\u0007\u0000\u0018S)\bN\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00da\bkeepdimsTg\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0003min\u00da\u0003max)\u0003\u00da\u0001x\u00da\u0004xmin\u00da\u0004xmax\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001d/home/antor/CarND-p3/model.py\u00da\u000bminmax_norm[\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001$\u0001$\u0002", null, null]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_normal", "name": "convolution2d_1", "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 24, "trainable": true, "bias": true, "subsample": [2, 2], "nb_col": 10, "nb_row": 10}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_normal", "name": "convolution2d_2", "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "subsample": [2, 2], "nb_col": 10, "nb_row": 10}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_normal", "name": "convolution2d_3", "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "subsample": [2, 2], "nb_col": 5, "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_normal", "name": "convolution2d_4", "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "subsample": [1, 1], "nb_col": 3, "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "valid", "init": "glorot_normal", "name": "convolution2d_5", "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "subsample": [1, 1], "nb_col": 3, "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 64, "W_regularizer": null, "b_constraint": null, "init": "glorot_normal", "name": "dense_1", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 176}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 32, "W_regularizer": null, "b_constraint": null, "init": "glorot_normal", "name": "dense_2", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 16, "W_regularizer": null, "b_constraint": null, "init": "glorot_normal", "name": "dense_3", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 8, "W_regularizer": null, "b_constraint": null, "init": "glorot_normal", "name": "dense_4", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 16}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_5", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 8}}]}