{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[56, 24], [0, 0]], "name": "cropping2d_1", "input_dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"border_mode": "valid", "pool_size": [1, 2], "name": "averagepooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [1, 2]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s\\\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0002\u0000|\u0000\u0000|\u0001\u0000\u0018|\u0002\u0000|\u0001\u0000\u0018\u001bd\u0007\u0000\u0018S)\bN\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00da\bkeepdimsTg\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0003min\u00da\u0003max)\u0003\u00da\u0001x\u00da\u0004xmin\u00da\u0004xmax\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001d/home/antor/CarND-p3/model.py\u00da\u000bminmax_norm[\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001$\u0001$\u0002", null, null]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 24, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "nb_col": 10, "init": "glorot_normal", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 10, "name": "convolution2d_1", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 16, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "nb_col": 10, "init": "glorot_normal", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 10, "name": "convolution2d_2", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 16, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "nb_col": 5, "init": "glorot_normal", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_3", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 16, "bias": true, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "nb_col": 3, "init": "glorot_normal", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 16, "bias": true, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "nb_col": 3, "init": "glorot_normal", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_5", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 64, "activation": "linear", "name": "dense_1", "b_constraint": null, "W_constraint": null, "init": "glorot_normal", "input_dim": 176}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 32, "activation": "linear", "name": "dense_2", "b_constraint": null, "W_constraint": null, "init": "glorot_normal", "input_dim": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 16, "activation": "linear", "name": "dense_3", "b_constraint": null, "W_constraint": null, "init": "glorot_normal", "input_dim": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 8, "activation": "linear", "name": "dense_4", "b_constraint": null, "W_constraint": null, "init": "glorot_normal", "input_dim": 16}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 1, "activation": "linear", "name": "dense_5", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 8}}]}