{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[56, 24], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"strides": [1, 2], "name": "averagepooling2d_1", "pool_size": [1, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s\\\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0002\u0000|\u0000\u0000|\u0001\u0000\u0018|\u0002\u0000|\u0001\u0000\u0018\u001bd\u0007\u0000\u0018S)\bN\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00da\bkeepdimsTg\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0003min\u00da\u0003max)\u0003\u00da\u0001x\u00da\u0004xmin\u00da\u0004xmax\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001d/home/antor/CarND-p3/model.py\u00da\u000bminmax_norm[\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001$\u0001$\u0002", null, null], "trainable": true, "output_shape": null, "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "nb_filter": 24, "activation": "linear", "activity_regularizer": null, "nb_col": 10, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "bias": true, "W_regularizer": null, "nb_row": 10, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_normal", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_2", "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "nb_col": 10, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "bias": true, "W_regularizer": null, "nb_row": 10, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_normal", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_3", "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "bias": true, "W_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_normal", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "bias": true, "W_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_normal", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_5", "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "bias": true, "W_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_normal", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"output_dim": 64, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "init": "glorot_normal", "bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": 176}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"output_dim": 32, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "init": "glorot_normal", "bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.4}, "class_name": "Dropout"}, {"config": {"output_dim": 16, "name": "dense_3", "activation": "linear", "activity_regularizer": null, "init": "glorot_normal", "bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": 32}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 8, "name": "dense_4", "activation": "linear", "activity_regularizer": null, "init": "glorot_normal", "bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": 16}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 1, "name": "dense_5", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": 8}, "class_name": "Dense"}], "class_name": "Sequential"}