{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[56, 24], [0, 0]], "input_dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [1, 2], "pool_size": [1, 2]}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s\\\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0002\u0000|\u0000\u0000|\u0001\u0000\u0018|\u0002\u0000|\u0001\u0000\u0018\u001bd\u0007\u0000\u0018S)\bN\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00da\bkeepdimsTg\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0003min\u00da\u0003max)\u0003\u00da\u0001x\u00da\u0004xmin\u00da\u0004xmax\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001d/home/antor/CarND-p3/model.py\u00da\u000bminmax_norm[\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001$\u0001$\u0002", null, null], "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 10, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "valid", "nb_filter": 24, "nb_row": 10, "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2], "b_constraint": null, "init": "glorot_normal", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 10, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "valid", "nb_filter": 16, "nb_row": 10, "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2], "b_constraint": null, "init": "glorot_normal", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "valid", "nb_filter": 16, "nb_row": 5, "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2], "b_constraint": null, "init": "glorot_normal", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "valid", "nb_filter": 16, "nb_row": 3, "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "init": "glorot_normal", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "border_mode": "valid", "nb_filter": 16, "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "init": "glorot_normal", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 64, "W_constraint": null, "name": "dense_1", "init": "glorot_normal", "input_dim": 176, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 32, "W_constraint": null, "name": "dense_2", "init": "glorot_normal", "input_dim": 64, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.4}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 16, "W_constraint": null, "name": "dense_3", "init": "glorot_normal", "input_dim": 32, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 8, "W_constraint": null, "name": "dense_4", "init": "glorot_normal", "input_dim": 16, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null, "name": "dense_5", "init": "glorot_uniform", "input_dim": 8, "b_constraint": null, "activation": "linear"}}], "keras_version": "1.2.0"}