{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "cropping": [[56, 24], [0, 0]], "name": "cropping2d_1", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"name": "averagepooling2d_1", "pool_size": [1, 2], "strides": [1, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}, "class_name": "AveragePooling2D"}, {"config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s\\\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000g\u0003\u0000d\u0005\u0000d\u0006\u0000\u0083\u0001\u0002}\u0002\u0000|\u0000\u0000|\u0001\u0000\u0018|\u0002\u0000|\u0001\u0000\u0018\u001bd\u0007\u0000\u0018S)\bN\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00da\bkeepdimsTg\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0003min\u00da\u0003max)\u0003\u00da\u0001x\u00da\u0004xmin\u00da\u0004xmax\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\u001d/home/antor/CarND-p3/model.py\u00da\u000bminmax_norm[\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001$\u0001$\u0002", null, null], "name": "lambda_1", "arguments": {}, "trainable": true, "output_shape": null, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "bias": true, "name": "convolution2d_1", "activation": "linear", "border_mode": "valid", "nb_row": 10, "trainable": true, "activity_regularizer": null, "nb_col": 10, "subsample": [2, 2], "init": "glorot_normal", "b_regularizer": null, "W_regularizer": null, "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "name": "convolution2d_2", "activation": "linear", "border_mode": "valid", "nb_row": 10, "trainable": true, "activity_regularizer": null, "nb_col": 10, "subsample": [2, 2], "init": "glorot_normal", "b_regularizer": null, "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "name": "convolution2d_3", "activation": "linear", "border_mode": "valid", "nb_row": 5, "trainable": true, "activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "init": "glorot_normal", "b_regularizer": null, "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "name": "convolution2d_4", "activation": "linear", "border_mode": "valid", "nb_row": 3, "trainable": true, "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_normal", "b_regularizer": null, "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "name": "convolution2d_5", "activation": "linear", "border_mode": "valid", "nb_row": 3, "trainable": true, "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_normal", "b_regularizer": null, "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_1", "activation": "linear", "input_dim": 176, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 64, "init": "glorot_normal", "b_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_2", "activation": "linear", "input_dim": 64, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 32, "init": "glorot_normal", "b_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.4}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_3", "activation": "linear", "input_dim": 32, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 16, "init": "glorot_normal", "b_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_4", "activation": "linear", "input_dim": 16, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 8, "init": "glorot_normal", "b_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_5", "activation": "linear", "input_dim": 8, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}